/*
		Стандартная библиотека С++. Контейнеры. Итераторы.
				Алгоритмы. Предикаты. Функторы.
	Создать приложение для работы автосалона. Необходимо хранить 
информацию о продаваемых автомобилях (название, год выпуска, объем 
двигателя, цена). Реализовать интерфейс для добавления, удаления, 
редактирования и печати данных. Предусмотреть сортировку данных по 
различным параметрам, а также поиск данных по различным критериям.
При реализации приложения необходимо использовать контейнеры, 
итераторы, функторы, предикаты и алгоритмы
*/

#include <Windows.h>
#include <iostream>
#include <conio.h>

using std::cout;
using std::cin;
using std::endl;

int main()
{
	SetConsoleCP(1251);
	/*
	Задает кодовую страницу ввода, используемую консолью, связанной с вызывающим процессом.
	Консоль использует страницу входного кода для преобразования ввода с клавиатуры
	в соответствующее символьное значение.
	*/
	SetConsoleOutputCP(1251);
	/*
	Задает выходную кодовую страницу, используемую консолью, связанной с вызывающим процессом.
	Консоль использует свою кодовую страницу вывода для преобразования символьных значений,
	записанных различными функциями вывода, в изображения, отображаемые в окне консоли.
	*/



}